{
  "title": "Authentication",
  "pages": [
    {
      "url": "https://makerkit.dev/docs/next-supabase-turbo/going-to-production/authentication",
      "title": "Setting the Supabase Auth Settings in Production",
      "content": "Setting the Supabase Auth Settings in ProductionConfiguring Authentication's production configuration in the Next.js Supabase SaaS kit\n\nSupabase needs a few settings to be configured in their Dashboard to work correctly.This guide will walk you through the steps to get your Supabase authentication set up in your Production environment. The dev environment does not require any configuration.Skipping this step will result in your users not being able to log in or sign up.Third Party ProvidersThird Party providers need to be configured, managed and enabled fully on the provider's and Supabase's side. Makerkit does not need any configuration (beyond setting the provider to be displayed in the UI).Please read Supabase's documentation on how to set up third-party providers.Authentication URLsThe first thing you need to do is to set the authentication URLs in the Supabase Dashboard. These URLs are used to redirect users to the correct page after they have logged in or signed up.Go to the Supabase Dashboard.Click on the project you want to use.Go to the Authentication tab.Click on URL Configuration.Add your Site URL to the Site URL field. This is the URL of your MakerKit site (e.g. https://my-site.com).Add your Redirect URLs to the Redirect URLs field. This is the URL of your MakerKit site with /auth/callback appended to it (e.g. https://my-site.com/auth/callback).Failure to set these URLs will result in your users not being able to log in or sign up.Custom SMTPSupabase's SMTP settings have low limits and low deliverability. If you want your emails to go out and be delivered, please remember to set an alternative SMTP provider in the Supabase settings.Go to the Supabase Dashboard.Click on the project you want to use.Go to the Project Settings tab.Click on Auth.Tweak the SMTP Settings settings to your liking according to your provider's documentation.Please refer to the Supabase documentation for more information.TroubleshootingIf you are having authentication issues, ensure that the Site URL and Redirect URLs are correct. If you are using a custom domain, ensure that you are using the correct domain in the Site URL and Redirect URLs.NB: if your domain includes \"www\", ensure you include it in the Site URL and Redirect URLs. If your domain does not include \"www\", ensure you do not include it in the Site URL and Redirect URLs. If these do not match, your users will not be able to login.If something is still not working, please open a support ticket with any useful information (such as server logs)."
    },
    {
      "url": "https://makerkit.dev/docs/next-supabase-turbo/troubleshooting/troubleshooting-authentication",
      "title": "Troubleshooting authentication issues in the Next.js Supabase kit",
      "content": "Troubleshooting authentication issues in the Next.js Supabase kitTroubleshoot issues related to authentication in the Next.js Supabase SaaS kit\n\nSupabase redirects to localhost instead of my website URLThis is most likely an issue related to not having set up the Authentication URL in the Supabase settings as describe in the going to production guide;Cannot Receive Emails from SupabaseThis issue may arise if you have not setup an SMTP provider from within Supabase.Supabase's own SMTP provider has low limits and low deliverability, therefore you must set up your own - and only use the default Supabase's one for testing purposes.Cannot sign in with oAuth providerThis is most likely a settings issues from within the Supabase dashboard or in the provider's settings.Please read Supabase's documentation on how to set up third-party providers."
    }
  ]
}