{
  "title": "Local Development",
  "pages": [
    {
      "url": "https://makerkit.dev/docs/next-supabase-turbo/emails/inbucket",
      "title": "InBucket for local development in the Next.js Supabase Starter Kit",
      "content": "InBucket for local development in the Next.js Supabase Starter KitLearn how to use InBucket for local development in the Next.js Supabase Starter Kit.\n\nWhen developing locally, Supabase uses InBucket to capture emails sent during development. This allows you to test email functionality without actually sending emails to real addresses.Makerkit also uses InBucket for sending non-authentication emails, such as team invitations and account deletion confirmations.What is InBucket?InBucket is a disposable email service that captures all emails sent during local development. It's particularly useful for testing:Email verification flowsPassword reset emailsTeam invitationsNotification emailsAny other transactional emailsAccessing InBucketWhen running Supabase locally, InBucket is automatically available at:http://localhost:54324You can view any captured emails by:Going to http://localhost:54324Finding your test email in the list of received messagesCommon Use Cases1. Email VerificationWhen testing user signup:Create a new account using any email addressGo to InBucket at http://localhost:54324Find the verification emailClick the verification link or copy the verification code2. Password ResetTo test password reset flows:Request a password reset using any emailCheck InBucket for the reset emailUse the reset link or code to complete the process3. Team InvitationsWhen testing team invites:Send an invitation to any email addressCheck InBucket for the invitation emailUse the invitation link to acceptInBucket vs Production EmailsRemember that InBucket is for development only. In production:Configure a proper email service provider (Resend, SendGrid, etc.)Set up proper email authentication (SPF, DKIM)Use production-grade SMTP settingsMonitor email deliverabilityUsing a different email provider during local developmentIf you want to use a different email provider, switch the environment variables at apps/web/.env.development:EMAIL_SENDER=test@makerkit.devEMAIL_PORT=EMAIL_HOST=EMAIL_TLS=EMAIL_USER=EMAIL_PASSWORD=NB: Supabase authentication emails will still be sent using InBucket.ConclusionInBucket is a valuable tool for local development, allowing you to:Test email flows without sending real emailsIterate quickly on email templatesDebug email-related issuesDevelop with confidenceRemember to switch to a proper email provider when deploying to production!"
    }
  ]
}